Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateNewDesignOption Property
 Cannot create a new empty design option
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateNewDesignOption { get; }
Public Shared ReadOnly Property CannotCreateNewDesignOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateNewDesignOption {
	FailureDefinitionId^ get ();
}
static member CannotCreateNewDesignOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace